notes/chapter1.org
#+TITLE: Data Structures and Algorithms using Java - Chapter 1

* Overview and Java Review
** Data Structures
*** What is Data?
- *data* is information
- studies show that programs spend 80% of their execution time searching through memory to locate necessary data
- *Data Structres* is the area of computer science that dresses the issues of data storage requirements of a program and the speed at which the program loactes the data it processes
*** What is a Data Structure?
- a *data structure* is an organization of information, usually in memory, for better algorithm efficiency
- *overhead* is the extra storage above the size of the data set that an organization scheme requires
- a good data structure is one that organizes the data in a way that facilitates the operations performed on the data
  + it does this while keeping total storage requirements at, or close to, the size of the data set
- there are two types of of data structures:
  1. built-in data structures
     - scemes for storing data that are part of a programming language
       + examples include memory cell (variable) declarations, arrays, and Java's String class
  2. programmer-defined data structures
     - schemes for storing data that are conceived and implemented by the programmer of a particular program
       + examples of these are parallel arrays, class definitions, hashing schemes, linked lists, trees, stacks, and queues

** Selecting a Data Structure
*** The Data Structure's Impact on PErformance


*** Determining the PErformance of a Data Structure
- evaluation takes place during the early design stages, before any code is written
- two sets of calculations are performed on each candidate data structure to measure its performance:
  1. calculations to determine the speed of the operations to be performed on the data
  2. calculations to determine the amount of overhead associated with the data structure
- the best structure for a particular application is usually a compromise between speed, overhead, and cost
*** The Trade-Off Process
- the selection of the best data structure should always be based on:
    "the least expenseive data structure that satisfies the speed requirements and storage constraints of the application"
- when data processing is performed to update a display viewed by humans, an operation time of 0.1 is more than adequate
  + studies show that faster response times are impercetible to humans
- software engineering practices mandate that speed requirements be specified before tue program is designed
  + they must be documented in the project's /Requirements Document/
- cost of a data structure is primarily the labor cost of developing the code to implement it
  + this includes its design, coding, testing, and documentation
  + studies indicate that the cost of software is directly proportional to the number of lines of code that the software contains

** Fundamental Concepts
*** Terminology
- *field* - an indivisible piece of data
  + /indivisible/ means that if the data were divided any further, it would lose all meaning
- *node* - a group of related fields
- *key field* - a designated field in a node whose contents are used to identify, or refer to, the node
- *homogeneous data set* - a set of nodes in which all the nodes have identical fields (number and type)
  + most data sets are homogeneous
*** Access Modes
- /access/ is the process by which a node is located in memory
  + once located, and /operation/ can be performed on the node
- there are two generic ways or modes used to specify the node to be accessed:
  1. the node number mode
     - the number of the node is specified
  2. the key field mode
     - the contents of the designated key field are specified
- most data structures utilize the key field access mode
*** Linear Lists
- a collection of /n/ nodes is a linear list if:
  + there is a unique first node, N_1
  + there is a unique last node, N_n
  + for any other node, N_i, a unique node, N_i-1, comes before it and a unique node, N_i+1, comes after it
*** Data Structure Operations
- operations performed on data structures can be arranged in a hierarchy.
- the most fundamental operation is /insert/
  + /insert/ adds a node to the data structure
  + this is the most fundamental operation because all data sets would be empty without it and os it must be available for all data sets
- the next level of operation hierarchy includes /fetch/ and /delete/
  + /fetch/ returns a node from the data set
  + /delete/ elimates a node from the data set
- the /update/ operation is a level above /fetch/ and /delete/
  + it is considered higher because it can be implemented to /delete/ a node and then /insert/ a new one in its place
  + all fields of a node must be supplied to a /node/ during an /update/ operation, even if only one is being updated
*** Implementing a Programmer-Defined Data Structure
- in OOP languages, data structures are implemented using the class construct
  + the memory required for the data structure is specified as the class's data members and the operations are stored as methods
- the best way to implement a data structure is to implement it as a /generic/ data stracture
  + generic data structures are implemented in such a way that they can be used for multiple applications, regardless of node strtucture
  + they reduce the cost of software development because, once coded for an application, they do not need to be recoded for subsequent applications
- guidelines for the implementation of a data structure in a generic way:
  + node definition and data structure are coded as separate classes
  + node definition class (/interface/ class):
    - always contains a data member for each field
    - usually contains a toString method to facilitate the output of fields
  + data structure class (/implementation/ class):
    - allocates storage to maintain overhead
    - allocates storage for the data set
    - provides initialization methods
    - provides methods to perform the required operations
    - usually provides a method to display the contents of all nodes
