notes/chapter1.tex
% Created 2020-09-05 Sat 22:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Robert S. Pratt}
\date{\today}
\title{Data Structures and Algorithms using Java - Chapter 1}
\hypersetup{
 pdfauthor={Robert S. Pratt},
 pdftitle={Data Structures and Algorithms using Java - Chapter 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Overview and Java Review}
\label{sec:org87e60b5}
\subsection{Data Structures}
\label{sec:org18de5ad}
\subsubsection{What is Data?}
\label{sec:org6f46280}
\begin{itemize}
\item \textbf{data} is information
\item studies show that programs spend 80\% of their execution time searching through memory to locate necessary data
\item \textbf{Data Structres} is the area of computer science that dresses the issues of data storage requirements of a program and the speed at which the program loactes the data it processes
\end{itemize}
\subsubsection{What is a Data Structure?}
\label{sec:org0941551}
\begin{itemize}
\item a \textbf{data structure} is an organization of information, usually in memory, for better algorithm efficiency
\item \textbf{overhead} is the extra storage above the size of the data set that an organization scheme requires
\item a good data structure is one that organizes the data in a way that facilitates the operations performed on the data
\begin{itemize}
\item it does this while keeping total storage requirements at, or close to, the size of the data set
\end{itemize}
\item there are two types of of data structures:
\begin{enumerate}
\item built-in data structures
\begin{itemize}
\item scemes for storing data that are part of a programming language
\begin{itemize}
\item examples include memory cell (variable) declarations, arrays, and Java's String class
\end{itemize}
\end{itemize}
\item programmer-defined data structures
\begin{itemize}
\item schemes for storing data that are conceived and implemented by the programmer of a particular program
\begin{itemize}
\item examples of these are parallel arrays, class definitions, hashing schemes, linked lists, trees, stacks, and queues
\end{itemize}
\end{itemize}
\end{enumerate}
\end{itemize}

\subsection{Selecting a Data Structure}
\label{sec:orgbbdd5be}
\subsubsection{The Data Structure's Impact on PErformance}
\label{sec:org5142eff}


\subsubsection{Determining the PErformance of a Data Structure}
\label{sec:orgec39950}
\begin{itemize}
\item evaluation takes place during the early design stages, before any code is written
\item two sets of calculations are performed on each candidate data structure to measure its performance:
\begin{enumerate}
\item calculations to determine the speed of the operations to be performed on the data
\item calculations to determine the amount of overhead associated with the data structure
\end{enumerate}
\item the best structure for a particular application is usually a compromise between speed, overhead, and cost
\end{itemize}
\subsubsection{The Trade-Off Process}
\label{sec:org6337a27}
\begin{itemize}
\item the selection of the best data structure should always be based on:
``the least expenseive data structure that satisfies the speed requirements and storage constraints of the application''
\item when data processing is performed to update a display viewed by humans, an operation time of 0.1 is more than adequate
\begin{itemize}
\item studies show that faster response times are impercetible to humans
\end{itemize}
\item software engineering practices mandate that speed requirements be specified before tue program is designed
\begin{itemize}
\item they must be documented in the project's \emph{Requirements Document}
\end{itemize}
\item cost of a data structure is primarily the labor cost of developing the code to implement it
\begin{itemize}
\item this includes its design, coding, testing, and documentation
\item studies indicate that the cost of software is directly proportional to the number of lines of code that the software contains
\end{itemize}
\end{itemize}

\subsection{Fundamental Concepts}
\label{sec:orgbaf55e0}
\subsubsection{Terminology}
\label{sec:org1361b10}
\begin{itemize}
\item \textbf{field} - an indivisible piece of data
\begin{itemize}
\item \emph{indivisible} means that if the data were divided any further, it would lose all meaning
\end{itemize}
\item \textbf{node} - a group of related fields
\item \textbf{key field} - a designated field in a node whose contents are used to identify, or refer to, the node
\item \textbf{homogeneous data set} - a set of nodes in which all the nodes have identical fields (number and type)
\begin{itemize}
\item most data sets are homogeneous
\end{itemize}
\end{itemize}
\subsubsection{Access Modes}
\label{sec:org2173997}
\begin{itemize}
\item \emph{access} is the process by which a node is located in memory
\begin{itemize}
\item once located, and \emph{operation} can be performed on the node
\end{itemize}
\item there are two generic ways or modes used to specify the node to be accessed:
\begin{enumerate}
\item the node number mode
\begin{itemize}
\item the number of the node is specified
\end{itemize}
\item the key field mode
\begin{itemize}
\item the contents of the designated key field are specified
\end{itemize}
\end{enumerate}
\item most data structures utilize the key field access mode
\end{itemize}
\subsubsection{Linear Lists}
\label{sec:org0411915}
\begin{itemize}
\item a collection of \emph{n} nodes is a linear list if:
\begin{itemize}
\item there is a unique first node, N\textsubscript{1}
\item there is a unique last node, N\textsubscript{n}
\item for any other node, N\textsubscript{i}, a unique node, N\textsubscript{i}-1, comes before it and a unique node, N\textsubscript{i}+1, comes after it
\end{itemize}
\end{itemize}
\subsubsection{Data Structure Operations}
\label{sec:orgc51e5dd}
\begin{itemize}
\item operations performed on data structures can be arranged in a hierarchy.
\item the most fundamental operation is \emph{insert}
\begin{itemize}
\item \emph{insert} adds a node to the data structure
\item this is the most fundamental operation because all data sets would be empty without it and os it must be available for all data sets
\end{itemize}
\item the next level of operation hierarchy includes \emph{fetch} and \emph{delete}
\begin{itemize}
\item \emph{fetch} returns a node from the data set
\item \emph{delete} elimates a node from the data set
\end{itemize}
\item the \emph{update} operation is a level above \emph{fetch} and \emph{delete}
\begin{itemize}
\item it is considered higher because it can be implemented to \emph{delete} a node and then \emph{insert} a new one in its place
\item all fields of a node must be supplied to a \emph{node} during an \emph{update} operation, even if only one is being updated
\end{itemize}
\end{itemize}
\subsubsection{Implementing a Programmer-Defined Data Structure}
\label{sec:org73b0ef0}
\begin{itemize}
\item in OOP languages, data structures are implemented using the class construct
\begin{itemize}
\item the memory required for the data structure is specified as the class's data members and the operations are stored as methods
\end{itemize}
\item the best way to implement a data structure is to implement it as a \emph{generic} data stracture
\begin{itemize}
\item generic data structures are implemented in such a way that they can be used for multiple applications, regardless of node strtucture
\item they reduce the cost of software development because, once coded for an application, they do not need to be recoded for subsequent applications
\end{itemize}
\item guidelines for the implementation of a data structure in a generic way:
\begin{itemize}
\item node definition and data structure are coded as separate classes
\item node definition class (\emph{interface} class):
\begin{itemize}
\item always contains a data member for each field
\item usually contains a toString method to facilitate the output of fields
\end{itemize}
\item data structure class (\emph{implementation} class):
\begin{itemize}
\item allocates storage to maintain overhead
\item allocates storage for the data set
\item provides initialization methods
\item provides methods to perform the required operations
\item usually provides a method to display the contents of all nodes
\end{itemize}
\end{itemize}
\end{itemize}
