notes/chapter1.org
*** Procedural Abstractions and Abstract Data Types
- in computer science, we encounter two abstractions:
  1. procedural abstractions
     - the implementation details of a method/procedure do not need to be known to use it
  2. data abstractions
     - the implementation details of a data structure do not need to be known to use it
     - only the the operation methods and their signatures need to be known so they can be used
- an *abstract data type* is a data structure that can be used with only this superficial level of understanding
- *standard abstract data type* is a data structure whose operation method signatures conform to a consistent format
  + this standardization provides the benefit that a programmer can change the data structure used in an existing application by changing one line: the line that declares the data structure object
  + standardizing abstract data types reduces the cost of software
*** Encapsulation
- *encapsulation* is the idea that code is written in a way that establishes /compiler enforced protocols/ for accessing the data that a program processes
- these protocols usually /restrict/ access to the data
- in computer science, it is said that encapsulation limits the /scope/ of the program statements that can acecss a data item
- *modularization* all methods dealing with encapsulated code are contained with in the same class

** Calculating Speed (Time Complexity)
- *wall time* is the considered speed of an algorithm in seconds
- /complexity analysis/ is used to remove platform-dependent factors that provide variance in estimated wall time execution
  + /time complexity/ is from a speed viewpoint
    - expressed as a mathematical function T(n), where /n/ is usually the number of pieces of data the algorithm processes
  + /space complexity/ is from a storage viewpoint
- /Big-O Analysis/ can be used to greatly simplify complexity analysis
*** Big-O Analysis (O Standing for _O_rder of Magnitude)
- used to set a boind on the upper limit of a mathematical function
  + based on the assumption that one of the terms of the function will /dominate/, or contribute, all but a negligible portion of the fuction's value
- provides the following guideline:
    to approximate the value of a function of /n/, as /n/ gets large, it is sufficient to identify its dominant term and evaluate it for adequately large values of /n/
- used to evaluate functional relationships in all fields of engineering
  + however, in software engineering, its use to evaluate the speed of an algorithm is simpler than its use in other engineering disciplines because of the limited number of functions that result from the analysis of algorithm complexity
- two other analysis techniques used to determine the /approximate/ value of a mathematical function:
  + Big-Omega
    - used to determine the lower bound
  + Big-Theta
    - used to analyze functions whose upper and lower bounds are of the same order of magnitude
*** Algorithm Speed
- two factors to consider when discussing algorithm speed:
  1. the /relative/ speed of the algorithm to other algorithms
     - used to determine whether an algorithm (or code segment) is faster or slower than other algorithms
  2. the /absolute/ speed of the algorithm
     - used to determine the actual execution time, in seconds, of the algorithm
- both speeds can be simplified using Big-O analysis, though its approximation may invalidate its use for calculating absolute speed for some time-critical applications
*** Relative Speed of Algorithms
- relative speed is determined by analyzing each algorithm's pseudocode to determing their speed function's dominant term.
  + the fastest algorithm is the one whose dominant term occupies the highest position in the following table; the slowest has a dominant term in the lowest position
*Relative Dominance of Common Algorithm Complexity Terms*
| Dominant Term                                            | Name of Dominant Term | Relative Magnitude of the Dominant Term |
|----------------------------------------------------------+-----------------------+-----------------------------------------|
| /c/, a constant                                          | Constant              | Relative Magnitude of the Dominant Term |
| log_2(/n/)                                               | Logarithmic           |                                       2 |
| /n/                                                      | Linear                |                                       3 |
| /n/log_2(/n/)                                            | Linear logarithmic    |                                       4 |
| Powers of /n/: /n/^2 < /n/^3 < ... < /n/^/i/ (/i/ < /n/) | Polynomial            |                                       5 |
| /c/^/n/                                                  | Exponential           |                                       6 |
| /n/!                                                     | Factorial             |                             7 (largest) |

**** Relative Speed Case Study: The Binary Search Algorithm
- the binary search algorithm is a technique for finding a data item stored in an array
  + given the data item, called the /search value/ the algorith returns the item's array index value
  + the algorithm /assumes/ the array is sorted (this case study assumes ascending order)
- the algorithm idententifies a portion of the array that includes the serach value as a /sub-array/
  + initially, the entire array is the sub-array   
*** Absolute Speed of an Algorithm
- the fastest algorithm identified by Big-O analysis might not always be fast enough for an application
- the most reliable way to determine the absoute speed of an algorithm is code it and test it on a representative number of preocesses
  + this is often to time consuming and costly to implement during the design process
- assuming the CPU is dedicated to the execution of the algorithm, execution time, /t/, can be expressed as:
            /t/ = /t/_/m/1 + /t/_/m/2 + ... + /t/_/m//n/
  + where /n/ is the total number of machine language instructions in the translation of the algorithm
        and
  + /t/_/m//i/ is the time required to execute the /i/th machine language instruction
  + this equation can be simplified down to:
            g
            \Sigma (/t/_/i/ * /n/_/i/)
            /i/=1
    - /g/ is the number of instruction groupings
    - /t/_/i/ is the time required to execute an instruction in the /i/th grouping
        and
    - /n/_/i/ is the number of instructions in group /i/
- in the simplest case, instructions are assumed to be in one of two groups (/g/ = 2)
  1. those that access memory
  2. those that do not access memory
- distinguishing between instructions that do and do not access memory is import because accessing memory is significantly slower than those that do not
  + instructions that do not access memory are called /nonaccess/ instructions
  + speed of memory is orders of magnitude slower than CPU logic operation performance time

