notes/chapter1.tex
\subsubsection{Procedural Abstractions and Abstract Data Types}
\label{sec:org56eeea8}
\begin{itemize}
\item in computer science, we encounter two abstractions:
\begin{enumerate}
\item procedural abstractions
\begin{itemize}
\item the implementation details of a method/procedure do not need to be known to use it
\end{itemize}
\item data abstractions
\begin{itemize}
\item the implementation details of a data structure do not need to be known to use it
\item only the the operation methods and their signatures need to be known so they can be used
\end{itemize}
\end{enumerate}
\item an \textbf{abstract data type} is a data structure that can be used with only this superficial level of understanding
\item \textbf{standard abstract data type} is a data structure whose operation method signatures conform to a consistent format
\begin{itemize}
\item this standardization provides the benefit that a programmer can change the data structure used in an existing application by changing one line: the line that declares the data structure object
\item standardizing abstract data types reduces the cost of software
\end{itemize}
\end{itemize}
\subsubsection{Encapsulation}
\label{sec:org488b21d}
\begin{itemize}
\item \textbf{encapsulation} is the idea that code is written in a way that establishes \emph{compiler enforced protocols} for accessing the data that a program processes
\item these protocols usually \emph{restrict} access to the data
\item in computer science, it is said that encapsulation limits the \emph{scope} of the program statements that can acecss a data item
\item \textbf{modularization} all methods dealing with encapsulated code are contained with in the same class
\end{itemize}

\subsection{Calculating Speed (Time Complexity)}
\label{sec:orga85943a}
\begin{itemize}
\item \textbf{wall time} is the considered speed of an algorithm in seconds
\item \emph{complexity analysis} is used to remove platform-dependent factors that provide variance in estimated wall time execution
\begin{itemize}
\item \emph{time complexity} is from a speed viewpoint
\begin{itemize}
\item expressed as a mathematical function T(n), where \emph{n} is usually the number of pieces of data the algorithm processes
\end{itemize}
\item \emph{space complexity} is from a storage viewpoint
\end{itemize}
\item \emph{Big-O Analysis} can be used to greatly simplify complexity analysis
\end{itemize}
\subsubsection{Big-O Analysis (O Standing for \_O\textsubscript{rder} of Magnitude)}
\label{sec:org4508035}
\begin{itemize}
\item used to set a boind on the upper limit of a mathematical function
\begin{itemize}
\item based on the assumption that one of the terms of the function will \emph{dominate}, or contribute, all but a negligible portion of the fuction's value
\end{itemize}
\item provides the following guideline:
to approximate the value of a function of \emph{n}, as \emph{n} gets large, it is sufficient to identify its dominant term and evaluate it for adequately large values of \emph{n}
\item used to evaluate functional relationships in all fields of engineering
\begin{itemize}
\item however, in software engineering, its use to evaluate the speed of an algorithm is simpler than its use in other engineering disciplines because of the limited number of functions that result from the analysis of algorithm complexity
\end{itemize}
\item two other analysis techniques used to determine the \emph{approximate} value of a mathematical function:
\begin{itemize}
\item Big-Omega
\begin{itemize}
\item used to determine the lower bound
\end{itemize}
\item Big-Theta
\begin{itemize}
\item used to analyze functions whose upper and lower bounds are of the same order of magnitude
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection{Algorithm Speed}
\label{sec:org9ec8c31}
\begin{itemize}
\item two factors to consider when discussing algorithm speed:
\begin{enumerate}
\item the \emph{relative} speed of the algorithm to other algorithms
\begin{itemize}
\item used to determine whether an algorithm (or code segment) is faster or slower than other algorithms
\end{itemize}
\item the \emph{absolute} speed of the algorithm
\begin{itemize}
\item used to determine the actual execution time, in seconds, of the algorithm
\end{itemize}
\end{enumerate}
\item both speeds can be simplified using Big-O analysis, though its approximation may invalidate its use for calculating absolute speed for some time-critical applications
\end{itemize}
\subsubsection{Relative Speed of Algorithms}
\label{sec:org4c08a69}
\begin{itemize}
\item relative speed is determined by analyzing each algorithm's pseudocode to determing their speed function's dominant term.
\begin{itemize}
\item the fastest algorithm is the one whose dominant term occupies the highest position in the following table; the slowest has a dominant term in the lowest position
\end{itemize}
\end{itemize}
\textbf{Relative Dominance of Common Algorithm Complexity Terms}
\begin{center}
\begin{tabular}{llr}
Dominant Term & Name of Dominant Term & Relative Magnitude of the Dominant Term\\
\hline
\emph{c}, a constant & Constant & Relative Magnitude of the Dominant Term\\
log\textsubscript{2}(\emph{n}) & Logarithmic & 2\\
\emph{n} & Linear & 3\\
\emph{n/log\textsubscript{2}(/n}) & Linear logarithmic & 4\\
Powers of \emph{n}: \emph{n/\textsuperscript{2} < /n/\textsuperscript{3} < \ldots{} < /n/\^{}/i} (\emph{i} < \emph{n}) & Polynomial & 5\\
\emph{c/\^{}/n} & Exponential & 6\\
\emph{n}! & Factorial & 7 (largest)\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Relative Speed Case Study: The Binary Search Algorithm
\label{sec:orgc92bae4}
\begin{itemize}
\item the binary search algorithm is a technique for finding a data item stored in an array
\begin{itemize}
\item given the data item, called the \emph{search value} the algorith returns the item's array index value
\item the algorithm \emph{assumes} the array is sorted (this case study assumes ascending order)
\end{itemize}
\item the algorithm idententifies a portion of the array that includes the serach value as a \emph{sub-array}
\begin{itemize}
\item initially, the entire array is the sub-array
\end{itemize}
\end{itemize}
\end{enumerate}
\subsubsection{Absolute Speed of an Algorithm}
\label{sec:org9875ed9}
\begin{itemize}
\item the fastest algorithm identified by Big-O analysis might not always be fast enough for an application
\item the most reliable way to determine the absoute speed of an algorithm is code it and test it on a representative number of preocesses
\begin{itemize}
\item this is often to time consuming and costly to implement during the design process
\end{itemize}
\item assuming the CPU is dedicated to the execution of the algorithm, execution time, \emph{t}, can be expressed as:
\emph{t} = \emph{t/\_/m/1 + /t/\_/m/2 + \ldots{} + /t/\_/m//n}
\begin{itemize}
\item where \emph{n} is the total number of machine language instructions in the translation of the algorithm
and
\item \emph{t/\_/m//i} is the time required to execute the /i/th machine language instruction
\item this equation can be simplified down to:
g
\(\Sigma\) (\emph{t/\_/i} * \emph{n/\_/i})
/i/=1
\begin{itemize}
\item \emph{g} is the number of instruction groupings
\item \emph{t/\_/i} is the time required to execute an instruction in the /i/th grouping
and
\item \emph{n/\_/i} is the number of instructions in group \emph{i}
\end{itemize}
\end{itemize}
\item in the simplest case, instructions are assumed to be in one of two groups (\emph{g} = 2)
\begin{enumerate}
\item those that access memory
\item those that do not access memory
\end{enumerate}
\item distinguishing between instructions that do and do not access memory is import because accessing memory is significantly slower than those that do not
\begin{itemize}
\item instructions that do not access memory are called \emph{nonaccess} instructions
\item speed of memory is orders of magnitude slower than CPU logic operation performance time
\end{itemize}
\end{itemize}
