notes/chapter1.org
*** Data Structure Speed
- speed of an algorithm's operations is not the only factor; /frequency/ of each operation is also important
- the frequency-weighted average time is defined as:
        /t/_avg = (/t/_1 * /f/_1 + /t/_2 * /f/_2 + /t/_3 * /f/_3 + ... /t/_n * /f/_/n/)/(/f/_1 + /f/_2 + /f/_3 + ... + /f/_/n/)
  + /t/_/i/ is the speed of the /i/th operation (/i/ = 1, 2, 3, ..., /n/)
  + /n/ is the number of different operations available on the structure
        and
  + /f/_/i/ is the frequency of the /i/th operation (/i/ = 1, 2, 3, ..., /n/)
- the equation for /t/_avg can be expressed in a simpler form where the denominator is divided into each term of the numberator:
        /t/_avg = (/t/_1 * \rho_1 + /t/_2 * \rho_2 + /t/_3 + \rho_3 + ... + /t/_/n/ * \rho_/n/)
  + \rho_/i/ is the probability of the /i/th operation and is equal to /f/_/i/ / (/f/_1 + /f/_2 + /f/_3 + ... /f/_/n/)

** Calculating Memory Overhead (Space Complexity)\
- data structures that minimize overhead are said to be more /memory efficient/
- the parameter/metric used to specific how efficiently a data structure uses memory is /density/
- /Density/, /D/, is defined as:
        D = (information bytes)/(total bytes) = (information bytes)/(information bytes + overhead bytes)
  + /information bytes/ is the amount of memory required to store the information stored in teh structure, in bytes
  + /total bytes/ is the total amount of memory allocated to the structure, in bytes
    and
  + /overhead bytes/ is the amount of memory required to maintain the structure, in bytes
- the range of /D/ is 0 < /D/ < 1
  + memory efficient structures have a density close to 1
- some data structures require a set/constant amount of overhead, /O/, independent of the number of nodes
  + the density for these structures increases as the number of nodes in the data structure increases:
        /D/ = /w/ * /n/ / (/w/ * /n/ + /O/) = 1 / (1 + /O/ / (/w/ * /n/))
    - /w/ is the node width and is constant for a particular data structure
    - /n/ is the number nodes in the data structre

** Java Review
*** Arrays of Primitive Variables
- /primitive variables/ are single instances of integral or real types of information
- /duplicate definition/ compile error happens when a reference variable is declared more than once
*** Definition of a Class
- a *class* is a programmer-defined type that ocnsists of data definitions and methods (subprograms) that operate on that data
- the name of the class is the name of the newly defined data type
- each class and method will have an /access modifier/ that determines whether or not other parts of the program can interact with it
- an instance of a class is called an /object/
- there are two penmanship issues to follow when coding classes:
  1. names of classes should always beging with an uppercase letter
  2. names of data members and methods should be in Pascal Case
- parameter names used in method headings should not be the same as the names of data members
*** Declaration of an Object
- the sequence of code that declares the object is referred to as /client code/
*** Declaration of an Array of Ojects
- an array of objects is declared using a three-step process:
  1. declare a reference variable to store the location of the first element of the array
  2. declare an array of /n/ reference variables to store the address of the /n/ objects
  3. declare the /n/ objects, setting their locations into the array of reference variables
*** Objects that Contain Objects as Data Members
- objects can contain other objects as their parameters
