notes/chapter1.tex

\subsubsection{Data Structure Speed}
\label{sec:org747f8c0}
\begin{itemize}
\item speed of an algorithm's operations is not the only factor; \emph{frequency} of each operation is also important
\item the frequency-weighted average time is defined as:
\emph{t/\textsubscript{avg} = (/t/\textsubscript{1} * /f/\textsubscript{1} + /t/\textsubscript{2} * /f/\textsubscript{2} + /t/\textsubscript{3} * /f/\textsubscript{3} + \ldots{} /t/\textsubscript{n} * /f/\_/n})/(\emph{f/\textsubscript{1} + /f/\textsubscript{2} + /f/\textsubscript{3} + \ldots{} + /f/\_/n})
\begin{itemize}
\item \emph{t/\_/i} is the speed of the \emph{i/th operation (/i} = 1, 2, 3, \ldots{}, \emph{n})
\item \emph{n} is the number of different operations available on the structure
and
\item \emph{f/\_/i} is the frequency of the \emph{i/th operation (/i} = 1, 2, 3, \ldots{}, \emph{n})
\end{itemize}
\item the equation for \emph{t/\textsubscript{avg} can be expressed in a simpler form where the denominator is divided into each term of the numberator:
/t/\textsubscript{avg} = (/t/\textsubscript{1} * \(\rho\)\textsubscript{1} + /t/\textsubscript{2} * \(\rho\)\textsubscript{2} + /t/\textsubscript{3} + \(\rho\)\textsubscript{3} + \ldots{} + /t/\_/n} * \(\rho\)\_/n/)
\begin{itemize}
\item \(\rho\)\_/i/ is the probability of the \emph{i/th operation and is equal to /f/\_/i} / (\emph{f/\textsubscript{1} + /f/\textsubscript{2} + /f/\textsubscript{3} + \ldots{} /f/\_/n})
\end{itemize}
\end{itemize}

\subsection{Calculating Memory Overhead (Space Complexity)$\backslash$}
\label{sec:orge949c91}
\begin{itemize}
\item data structures that minimize overhead are said to be more \emph{memory efficient}
\item the parameter/metric used to specific how efficiently a data structure uses memory is \emph{density}
\item \emph{Density}, \emph{D}, is defined as:
D = (information bytes)/(total bytes) = (information bytes)/(information bytes + overhead bytes)
\begin{itemize}
\item \emph{information bytes} is the amount of memory required to store the information stored in teh structure, in bytes
\item \emph{total bytes} is the total amount of memory allocated to the structure, in bytes
and
\item \emph{overhead bytes} is the amount of memory required to maintain the structure, in bytes
\end{itemize}
\item the range of \emph{D} is 0 < \emph{D} < 1
\begin{itemize}
\item memory efficient structures have a density close to 1
\end{itemize}
\item some data structures require a set/constant amount of overhead, \emph{O}, independent of the number of nodes
\begin{itemize}
\item the density for these structures increases as the number of nodes in the data structure increases:
\emph{D} = \emph{w} * \emph{n} / (\emph{w} * \emph{n} + \emph{O}) = 1 / (1 + \emph{O} / (\emph{w} * \emph{n}))
\begin{itemize}
\item \emph{w} is the node width and is constant for a particular data structure
\item \emph{n} is the number nodes in the data structre
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{Java Review}
\label{sec:org99aa8b5}
\subsubsection{Arrays of Primitive Variables}
\label{sec:org7fa9008}
\begin{itemize}
\item \emph{primitive variables} are single instances of integral or real types of information
\item \emph{duplicate definition} compile error happens when a reference variable is declared more than once
\end{itemize}
\subsubsection{Definition of a Class}
\label{sec:org78fdaf5}
\begin{itemize}
\item a \textbf{class} is a programmer-defined type that ocnsists of data definitions and methods (subprograms) that operate on that data
\item the name of the class is the name of the newly defined data type
\item each class and method will have an \emph{access modifier} that determines whether or not other parts of the program can interact with it
\item an instance of a class is called an \emph{object}
\item there are two penmanship issues to follow when coding classes:
\begin{enumerate}
\item names of classes should always beging with an uppercase letter
\item names of data members and methods should be in Pascal Case
\end{enumerate}
\item parameter names used in method headings should not be the same as the names of data members
\end{itemize}
\subsubsection{Declaration of an Object}
\label{sec:org68d4a5a}
\begin{itemize}
\item the sequence of code that declares the object is referred to as \emph{client code}
\end{itemize}
\subsubsection{Declaration of an Array of Ojects}
\label{sec:org9233bde}
\begin{itemize}
\item an array of objects is declared using a three-step process:
\begin{enumerate}
\item declare a reference variable to store the location of the first element of the array
\item declare an array of \emph{n} reference variables to store the address of the \emph{n} objects
\item declare the \emph{n} objects, setting their locations into the array of reference variables
\end{enumerate}
\end{itemize}
\subsubsection{Objects that Contain Objects as Data Members}
\label{sec:orgbd53cc0}
\begin{itemize}
\item objects can contain other objects as their parameters
\end{itemize}
\end{document}
